app/controllers/applications_controller.rb

  def index
    @applications = Application.all
---
SELECT "applications".* FROM "applications"

  def create
    @application = Application.new(application_params)

    respond_to do |format|
      if @application.save
---
INSERT INTO "applications" ("user_id", "job_listing_id", "resume", "cover_letter", "status", "contact", "date_submitted", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_application
      @application = Application.find(params[:id])
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT 1  [["id", 0]]